In [5]:
import pandas as pd

In [6]:
#load the data
movie_data = pd.read_csv('ml-latest-small/movies.csv', low_memory=False)

In [7]:
movie_data.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [8]:
#load the data
movie_tags = pd.read_csv('ml-latest-small/tags.csv', low_memory=False)
movie_tags.head()

   userId  movieId              tag   timestamp
0       2    60756            funny  1445714994
1       2    60756  Highly quotable  1445714996
2       2    60756     will ferrell  1445714992
3       2    89774     Boxing story  1445715207
4       2    89774              MMA  1445715200

In [9]:
#load the data
movie_rating = pd.read_csv('ml-latest-small/ratings.csv', low_memory=False)
movie_rating.head()

   userId  movieId  rating  timestamp
0       1        1     4.0  964982703
1       1        3     4.0  964981247
2       1        6     4.0  964982224
3       1       47     5.0  964983815
4       1       50     5.0  964982931

In [10]:
#load the data
movie_link = pd.read_csv('ml-latest-small/links.csv', low_memory=False)
movie_link.head()

   movieId  imdbId   tmdbId
0        1  114709    862.0
1        2  113497   8844.0
2        3  113228  15602.0
3        4  114885  31357.0
4        5  113041  11862.0

In [11]:
movie_rating.tail()

        userId  movieId  rating   timestamp
100831     610   166534     4.0  1493848402
100832     610   168248     5.0  1493850091
100833     610   168250     5.0  1494273047
100834     610   168252     5.0  1493846352
100835     610   170875     3.0  1493846415

In [12]:
movie_rating.shape

(100836, 4)

In [13]:
movie_rating.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100836 entries, 0 to 100835
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     100836 non-null  int64
 1   movieId    100836 non-null  int64
 2   rating     100836 non-null  float64
 3   timestamp  100836 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.1 MB

In [14]:
movie_rating.columns

Index(['userId', 'movieId', 'rating', 'timestamp'], dtype='object')

In [51]:
nass = pd.DataFrame(movie_rating['rating'].value_counts(),columns=['rating', 'number'])
nass

     rating number
4.0   26818    NaN
3.0   20047    NaN
5.0   13211    NaN
3.5   13136    NaN
4.5    8551    NaN
2.0    7551    NaN
2.5    5550    NaN
1.0    2811    NaN
1.5    1791    NaN
0.5    1370    NaN

In [53]:
nass = movie_rating[('rating':'5.0')].value_counts()

SyntaxError: invalid syntax (<ipython-input-53-8b0238afd847>, line 1)

In [46]:
ratings = pd.DataFrame(movie_rating.rating)#, columns=['rating', 'number']
bills = ratings.groupby('rating')

In [47]:
rats = pd.DataFrame(bills.count())
rats

Empty DataFrame
Columns: []
Index: [0.5, 1.0, 1.5, 2.0, 2.5, 3.0, 3.5, 4.0, 4.5, 5.0]

In [39]:
#Number of movies with the same rating
rateG = ratings.groupby('rating')
rateG = pd.DataFrame(rateG)

   rating  number
0     0.5       0
1     1.0       0
2     1.5       0
3     2.0       0
4     2.5       0
5     3.0       0
6     3.5       0
7     4.0       0
8     4.5       0
9     5.0       0

<ipython-input-35-e95ea3aa6420>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  rate_series = pd.Series(rateG)

Series([], dtype: float64)

In [29]:
data = {[rateG],
        'name': [1.0]}
mine = pd.DataFrame(data)

SyntaxError: invalid syntax (<ipython-input-29-770813f7b447>, line 2)

In [26]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [27]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2